{
	"projects": [
		{
			"id": "project1",
			"title": "Pet Tracker",
			"description": "A pet tracker app that allows you to track your pets using a LoRaWAN network",
			"demoLink": "#",
			"githubLink": "#",
			"learnMore": "/blog/pet-tracker",
			"blogContent": {
				"title": "Building a Pet Tracker with LoRaWAN",
				"date": "2024-03-15",
				"content": [
					{
						"type": "heading",
						"text": "Project Overview"
					},
					{
						"type": "paragraph",
						"text": "In this project, I began development of a pet tracking system using LoRaWAN technology and the Sidewalk gateway. The system consists of a small, lightweight tracker that can be attached to a pet's collar and a web application for monitoring their location."
					},
					{
						"type": "heading",
						"text": "Technical Stack"
					},
					{
						"type": "list",
						"items": [
							"LoRa Radio for long-range communication",
							"nrf52840 microcontroller for the tracker",
							"React for the web application",
							"MongoDB for storing location data"
						]
					},
					{
						"type": "heading",
						"text": "Getting Started"
					},
					{
						"type": "paragraph",
						"text": "We decided to use the Seeed Studio Xiao nRF52840 Sense board for the tracker, which comes with built-in Sidewalk capabilities. Once we got the board, we started small with the blinky example to get familiar with the Arduino IDE and bootloader."
					},
					{
						"type": "code",
						"language": "c",
						"text": "// blinky sameple\nvoid setup() {\n  pinMode(LED_BUILTIN, OUTPUT);\n}\n\nvoid loop() {\n  digitalWrite(LED_BUILTIN, HIGH);\n  delay(1000);\n  digitalWrite(LED_BUILTIN, LOW);\n  delay(1000);\n}"
					},
					{
						"type": "paragraph",
						"text": "We very quicky decided that the Arduino IDE is limited and decided to try PlatformIO. PlatformIO helps build a much larger project and compile it onto the microcontroller. We found a helpful <a href=\"https://wiki.seeedstudio.com/xiao-ble-sidewalk/\" target=\"_blank\" rel=\"noopener noreferrer\">sidewalk tutorial</a> that we thought would give us a nice start."
					},
					{
						"type": "heading",
						"text": "Prototype Board"
					},
					{
						"type": "paragraph",
						"text": "The Seeed Studio Xiao nRF52840 sense board only has Bluetooth which does allow communication with Amazon Sidewalk but only has a range of 100 meters. We decided to create a board that would include a E220-900T22S LoRa module and be portable. We also included a connector for a LiPo battery to be recharged using the USB-C from the microcontroller. We decided to stick with a rechargeable solution since we aren’t certain about how much power it draws. LoRa range is around 10km which allows for greater coverage and no need for GPS. The goal was to maximize battery while keeping a slim and comfortable profile for a pet."
					},
					{
						"type": "heading",
						"text": "Development"
					},
					{
						"type": "paragraph",
						"text": "I began following the guide and installed all the dependencies that are needed. There is a Nordic application for development called <a href=\"https://www.nordicsemi.com/Products/Development-tools/nrf-connect-for-desktop/\" target=\"_blank\" rel=\"noopener noreferrer\">nRF Connect</a> which helps setup zephyr packages and helps flash new firmware onto the nrf52840. Once I setup all the dev tools I ran the provisioning script for the Nordic SoC."
					},
					{
						"type": "image",
						"items": "sidewalk.png",
						"alt": "Sidewalk IOT Core",
						"caption": "Snapshot of IOT Core Sidewalk provisioned device"
					}
				]
			}
		},
		{
			"id": "project2",
			"title": "Dark Souls",
			"description": "A database application that stores weapons, armor, boss entities, spells, and all their corresponding stats",
			"demoLink": "#",
			"githubLink": "#",
			"learnMore": "/blog/dark-souls",
			"blogContent": {
				"title": "Creating a Dark Souls Database Application",
				"date": "2024-02-20",
				"content": [
					{
						"type": "paragraph",
						"text": "This project involved creating a comprehensive database of Dark Souls game data, including weapons, armor, bosses, and spells. The application allows users to search, filter, and compare different items and their stats."
					},
					{
						"type": "heading",
						"text": "Features"
					},
					{
						"type": "list",
						"items": [
							"Advanced search functionality",
							"Item comparison tool",
							"Build calculator",
							"Interactive UI with game-inspired design"
						]
					},
					{
						"type": "heading",
						"text": "Technical Implementation"
					},
					{
						"type": "paragraph",
						"text": "The application uses a RESTful API architecture with a PostgreSQL database. The frontend is built with React and styled with a dark theme inspired by the game's aesthetic."
					}
				]
			}
		},
		{
			"id": "project3",
			"title": "Project 3",
			"description": "Description of your third project goes here.",
			"demoLink": "#",
			"githubLink": "#",
			"learnMore": "/blog/project3",
			"blogContent": {
				"title": "Project 3: Detailed Overview",
				"date": "2024-01-10",
				"content": [
					{
						"type": "paragraph",
						"text": "This is a placeholder for the third project's blog post content."
					}
				]
			}
		}
	]
}
